{
  "_name_or_path": "neuralmind/bert-base-portuguese-cased",
  "architectures": [
    "BertForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "directionality": "bidi",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "dsc_documentos",
    "1": "dsc_documentos_estado_civil",
    "10": "dsc_requisitos",
    "11": "dsc_servico",
    "12": "enunciation",
    "13": "goodbye",
    "14": "greet",
    "15": "name_request",
    "2": "dsc_documentos_objetivo",
    "3": "dsc_documentos_objetivo_estado_civil",
    "4": "dsc_etapas_atendimento",
    "5": "dsc_horario_atendimento",
    "6": "dsc_horarios_funcionamento",
    "7": "dsc_horarios_funcionamento_objetivo",
    "8": "dsc_local_presencial",
    "9": "dsc_local_presencial_objetivo"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "dsc_documentos": "0",
    "dsc_documentos_estado_civil": "1",
    "dsc_documentos_objetivo": "2",
    "dsc_documentos_objetivo_estado_civil": "3",
    "dsc_etapas_atendimento": "4",
    "dsc_horario_atendimento": "5",
    "dsc_horarios_funcionamento": "6",
    "dsc_horarios_funcionamento_objetivo": "7",
    "dsc_local_presencial": "8",
    "dsc_local_presencial_objetivo": "9",
    "dsc_requisitos": "10",
    "dsc_servico": "11",
    "enunciation": "12",
    "goodbye": "13",
    "greet": "14",
    "name_request": "15"
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "transformers_version": "4.5.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 29794
}
